app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "1"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 07 Oct 2013 10:13:35 UTC +00:00], ["updated_at", Mon, 07 Oct 2013 10:13:35 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 2], ["created_at", Mon, 07 Oct 2013 10:14:04 UTC +00:00], ["product_id", 1], ["updated_at", Mon, 07 Oct 2013 10:14:04 UTC +00:00]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = 2  [["quantity", 2], ["updated_at", Mon, 07 Oct 2013 13:44:01 UTC +00:00]]
---
  def create
  # @line_item = LineItem.new(line_item_params)
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save