app/controllers/orders_controller.rb

  def new

    @cart = current_cart
    if @cart.line_items.empty?
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 20]]
SELECT 1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT 1  [["cart_id", 20]]

  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["address", ""], ["created_at", Mon, 21 Oct 2013 13:02:44 UTC +00:00], ["email", ""], ["name", ""], ["pay_type", "Purchase order"], ["updated_at", Mon, 21 Oct 2013 13:02:44 UTC +00:00]]